Repository: CodingBase2509/TagGame
Catalog: TagGame.Client/Resources/Localization/Errors.*.resx
Languages: de

# Errors.Validation.ParametersEmpty
source: Please fill out all required fields.
de: Bitte alle Pflichtfelder ausfüllen.

# Errors.Validation.DeviceId.Required
source: Device ID is required.
de: Device-ID ist erforderlich.

# Errors.Validation.DeviceId.NoEdgeSpaces
source: Device ID must not start or end with spaces.
de: Device-ID darf nicht mit Leerzeichen beginnen oder enden.

# Errors.Validation.DeviceId.MaxLength
source: Device ID must be at most 64 characters.
de: Device-ID darf höchstens 64 Zeichen haben.

# Errors.Validation.DeviceId.InvalidCharacters
source: Device ID may only contain letters, digits, '_' or '-'.
de: Device-ID darf nur Buchstaben, Ziffern, '_' oder '-' enthalten.

# Errors.Validation.DisplayName.NoEdgeSpaces
source: Display name must not start or end with spaces.
de: Anzeigename darf nicht mit Leerzeichen beginnen oder enden.

# Errors.Validation.DisplayName.MinLength
source: Display name must be at least 2 characters.
de: Anzeigename muss mindestens 2 Zeichen haben.

# Errors.Validation.DisplayName.MaxLength
source: Display name must be at most 64 characters.
de: Anzeigename darf höchstens 64 Zeichen haben.

# Errors.Validation.DisplayName.InvalidCharacters
source: Display name contains invalid characters.
de: Anzeigename enthält ungültige Zeichen.

# Errors.Validation.InvalidInput
source: Some inputs are invalid. Please check your entries.
de: Eingaben ungültig. Bitte prüfe deine Angaben.

# Errors.Validation.AvatarColor.InvalidFormat
source: Avatar color must be hex #RRGGBB or #AARRGGBB.
de: Avatar-Farbe muss hex #RRGGBB oder #AARRGGBB sein.

# Errors.Auth.MissingSub
source: Authentication required.
de: Anmeldung erforderlich.

# Errors.User.NotFound
source: User not found.
de: Benutzer nicht gefunden.

# Errors.Http.InvalidIfNoneMatch
source: Invalid If-None-Match header.
de: Ungültiger If-None-Match-Header.

# Errors.Http.IfMatchRequired
source: If-Match header is required.
de: If-Match-Header ist erforderlich.

# Errors.Http.InvalidIfMatch
source: Invalid If-Match header.
de: Ungültiger If-Match-Header.

# Errors.Http.IfMatchMismatch
source: If-Match did not match the current resource version.
de: If-Match stimmt nicht mit der aktuellen Version überein.

# Errors.User.EmailInUse
source: Email address is already in use.
de: E-Mail-Adresse wird bereits verwendet.

# Errors.User.ExistsForDevice
source: A user for this device already exists.
de: Für dieses Gerät existiert bereits ein Benutzer.

# Errors.Auth.DeviceIdMissing
source: Device ID is required.
de: Device-ID ist erforderlich.

# Errors.User.NotFoundForDevice
source: No user found for the provided device ID.
de: Kein Benutzer für die angegebene Device-ID gefunden.

# Errors.Auth.RefreshTokenMissing
source: Refresh token must not be empty.
de: Refresh-Token darf nicht leer sein.

# Errors.Auth.RefreshReuse
source: Refresh token reuse detected.
de: Wiederverwendung des Refresh-Tokens erkannt.

# Errors.Auth.RefreshInvalid
source: Invalid refresh token.
de: Ungültiges Refresh-Token.

# Errors.Auth.RefreshExpired
source: Refresh token expired.
de: Refresh-Token ist abgelaufen.

# Errors.Auth.RefreshRevoked
source: Refresh token was revoked.
de: Refresh-Token wurde widerrufen.

# Errors.Auth.InvalidToken
source: Invalid or expired authentication token.
de: Ungültiges oder abgelaufenes Anmeldetoken.

# Errors.Auth.MissingPermission
source: You don't have permission to perform this action.
de: Keine Berechtigung für diese Aktion.

# Errors.Auth.NotMember
source: You are not a member of this room.
de: Du bist kein Mitglied dieses Raums.

# Errors.Auth.Banned
source: You have been banned from this room.
de: Du wurdest aus diesem Raum verbannt.

# Errors.Auth.RoomIdMissing
source: Room identifier is missing.
de: Raum-ID fehlt.

# Errors.Http.Generic
source: Something went wrong. Please try again.
de: Es ist ein Fehler aufgetreten. Bitte versuche es erneut.

# Errors.Http.Network
source: Network error. Check your connection.
de: Netzwerkfehler. Bitte Verbindung prüfen.

# Errors.Http.Canceled
source: Operation was canceled.
de: Vorgang wurde abgebrochen.
